; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	infrared0 - mode
	spectrograph5 - mode
	infrared1 - mode
	spectrograph4 - mode
	spectrograph6 - mode
	spectrograph3 - mode
	spectrograph2 - mode
	GroundStation3 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	Star0 - direction
	Star5 - direction
	Star6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Star10 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument1 infrared0)
	(calibration_target instrument1 GroundStation4)
	(supports instrument2 infrared1)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 GroundStation3)
	(supports instrument3 spectrograph6)
	(supports instrument3 infrared1)
	(calibration_target instrument3 GroundStation1)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon9)
	(supports instrument4 spectrograph5)
	(supports instrument4 spectrograph2)
	(supports instrument4 spectrograph4)
	(calibration_target instrument4 Star0)
	(supports instrument5 infrared1)
	(supports instrument5 infrared0)
	(supports instrument5 spectrograph3)
	(calibration_target instrument5 GroundStation2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation4)
	(supports instrument6 infrared0)
	(supports instrument6 spectrograph2)
	(supports instrument6 infrared1)
	(calibration_target instrument6 GroundStation4)
	(supports instrument7 infrared0)
	(calibration_target instrument7 Star0)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star10)
)
(:goal (and
	(pointing satellite0 Star5)
	(pointing satellite1 GroundStation3)
	(have_image Star5 infrared1)
	(have_image Star5 spectrograph3)
	(have_image Star6 spectrograph4)
	(have_image Planet7 infrared1)
	(have_image Planet7 spectrograph3)
	(have_image Phenomenon8 infrared1)
	(have_image Phenomenon8 spectrograph3)
	(have_image Phenomenon9 spectrograph5)
	(have_image Star10 spectrograph4)
	(have_image Star10 infrared1)
))

)

; plan
1. (turn_to satellite2 star0 groundstation4)
   deleted: (pointing satellite2 groundstation4)
   added: (pointing satellite2 star0)
   goals met: 1 of 12
2. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 1 of 12
3. (calibrate satellite2 instrument4 star0)
   added: (calibrated instrument4)
   goals met: 1 of 12
4. (turn_to satellite2 star6 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 star6)
   goals met: 1 of 12
5. (take_image satellite2 star6 instrument4 spectrograph4)
   added: (have_image star6 spectrograph4)
   goals met: 2 of 12
6. (turn_to satellite2 star10 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 star10)
   goals met: 2 of 12
7. (take_image satellite2 star10 instrument4 spectrograph4)
   added: (have_image star10 spectrograph4)
   goals met: 3 of 12
8. (turn_to satellite2 phenomenon9 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 phenomenon9)
   goals met: 3 of 12
9. (turn_to satellite1 groundstation3 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 groundstation3)
   goals met: 4 of 12
10. (take_image satellite2 phenomenon9 instrument4 spectrograph5)
   added: (have_image phenomenon9 spectrograph5)
   goals met: 5 of 12
11. (switch_off instrument4 satellite2)
   deleted: (power_on instrument4)
   added: (power_avail satellite2)
   goals met: 5 of 12
12. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 5 of 12
13. (turn_to satellite2 groundstation2 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 groundstation2)
   goals met: 5 of 12
14. (calibrate satellite2 instrument5 groundstation2)
   added: (calibrated instrument5)
   goals met: 5 of 12
15. (turn_to satellite2 phenomenon8 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 phenomenon8)
   goals met: 5 of 12
16. (take_image satellite2 phenomenon8 instrument5 infrared1)
   added: (have_image phenomenon8 infrared1)
   goals met: 6 of 12
17. (take_image satellite2 phenomenon8 instrument5 spectrograph3)
   added: (have_image phenomenon8 spectrograph3)
   goals met: 7 of 12
18. (turn_to satellite2 planet7 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 planet7)
   goals met: 7 of 12
19. (take_image satellite2 planet7 instrument5 infrared1)
   added: (have_image planet7 infrared1)
   goals met: 8 of 12
20. (take_image satellite2 planet7 instrument5 spectrograph3)
   added: (have_image planet7 spectrograph3)
   goals met: 9 of 12
21. (turn_to satellite2 star10 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 star10)
   goals met: 9 of 12
22. (take_image satellite2 star10 instrument5 infrared1)
   added: (have_image star10 infrared1)
   goals met: 10 of 12
23. (turn_to satellite2 star5 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 star5)
   goals met: 10 of 12
24. (take_image satellite2 star5 instrument5 infrared1)
   added: (have_image star5 infrared1)
   goals met: 11 of 12
25. (take_image satellite2 star5 instrument5 spectrograph3)
   added: (have_image star5 spectrograph3)
   goals met: 12 of 12
